W6/W6D3/artshare/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "AppAcademy"], ["image_url", "appacadmey.com"], ["artist_id", 4]]
---
    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save

SELECT "artworks".* FROM "artworks"
---
    def index
        @artworks = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find_by(id: params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2 WHERE "artworks"."id" = $3  [["title", "slackacademy"], ["image_url", "slackacademy.com"], ["id", 3]]
---
    def update
        @artwork = Artwork.find_by(id: params[:id])
        if @artwork.nil?
            render json: {error: 'There is no artwork with that id.'}, status: 404
            return
        end
        if @artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
        @artwork = Artwork.find_by(id: params[:id])
        if @artwork
            @artwork.destroy