W6/W6D3/artshare/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE (user_id = '14')
---
  def index
    if params.has_key?(:user_id)
      @comments = Comment.where('user_id = ?', params[:user_id])
    elsif params.has_key?(:artwork_id)
      @comments = Comment.where(artwork_id: params[:artwork_id])
    else
      @comments = Comment.all