W6/W6D3/artshare/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "'Maplestory'"]]

  def update
    @user = User.find_by(id: params[:id])
    if @user.nil?
      render json: {error: 'There is no user with that id.'}, status: 404
      return
    end
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "Mason"], ["id", 7]]

  def destroy
    @user = User.find_by(id: params[:id])
    if @user
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 13]]