W12/W12D2/BenchBnB/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dwlgc6zFUOwQ3dwkLUPYEg"], ["updated_at", "2021-09-22 18:12:06.364940"], ["id", 1]]