W7/W7D2/MusicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "4x614CJrnN1-oS_sNDvtFg"], ["updated_at", "2021-08-17 23:52:46.396163"], ["id", 4]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "apple@apples.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by(email: username)