W6/W6D5/project_99cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        cat_params[:birth_date] = Date.parse(cat_params[:birth_date])
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "birth_date" = $2, "color" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["name", "Beefy"], ["birth_date", "2000-01-01"], ["color", "gold"], ["sex", "M"], ["description", "how ab out now"], ["updated_at", "2021-08-13 23:45:51.062574"], ["id", 6]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        unless @cat
            render json: {error: "That cat does not exist"}, status: 404
            return
        end

        if Cat.update(cat_params)