W7/W7D5/reddit_on_rails/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        if @sub
            @sub.mod_id = current_user.id
            render :show if @sub.save
---
INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new sub 1"], ["description", "final final final version 2"], ["mod_id", 1], ["created_at", "2021-08-20 22:17:25.706165"], ["updated_at", "2021-08-20 22:17:25.706165"]]